[
  {
    "name": "Valley Girl",
    "id": 1,
    "image": "../../img/valley-girl.jpg",
    "decade": "80s",
    "year": 1983,
    "rt_score": 82,
    "rt_range": "80-89",
    "director": "Martha Coolidge",
    "freakout": false,
    "genres": ["Comedy", "Drama", "Romance"],
    "trailerURL": "https://www.youtube.com/embed/GJU88bssElo",
    "summary": "An amusing elaboration upon the popular record by Moon Unit Zappa, Valley Girl stars Deborah Foreman in the title role. Spouting such California-dreamin' catchphrases as \"like, fer sure\", \"totally\", Deborah plays a teenaged suburbanite who falls in love with a wrong-side-of-the-freeway punk, played by Nicolas Cage. Despite his bad reputation, Cage is a sweetheart underneath, far more concerned about Deborah's reputation than she is. Little does he know that her parents, beautifully played by Colleen Camp and Frederick Forrest, are unreconstucted children of the sixties. Although it has some the usual cliched trappings of 1980s comedies -- silly misunderstandings, disguise scenes, slapstick-- Valley Girl remains a fresh and invigorating experience."
  },
  {
    "name": "Rumble Fish",
    "id": 2,
    "image": "../../img/rumble-fish.jpg",
    "decade": "80s",
    "year": 1983,
    "rt_score": 70,
    "rt_range": "70-79",
    "director": "Francis Ford Coppola",
    "freakout": false,
    "genres": ["Drama"],
    "trailerURL": "https://www.youtube.com/embed/lA4wiVaDKcw",
    "summary": "Disaffected and restless, Rusty James (Matt Dillon) is spoiling for a fight. Abandoned by his mother and living with his alcoholic father (Dennis Hopper), he hangs out with his girlfriend, Patty (Diane Lane), and his similarly aimless friends Midget (Larry Fishburne), Smokey (Nicolas Cage) and B.J. Jackson (Christopher Penn). When his brother, the Motorcycle Boy (Mickey Rourke), returns to town, Rusty hopes to gain guidance and wisdom from someone most people think is crazy."
  },
  {
    "name": "Racing With The Moon",
    "id": 3,
    "image": "../../img/racing-with-the-moon.jpg",
    "decade": "80s",
    "year": 1984,
    "rt_score": 60,
    "rt_range": "60-69",
    "director": "Richard Benjamin",
    "freakout": false,
    "genres": ["Comedy", "Drama", "Romance"],
    "trailerURL": "https://www.youtube.com/embed/Ye725hz386Y",
    "summary": "Sean Penn graduated to full stardom with the 1984 drama Racing with the Moon, even though the film itself hardly set new box office records. Set in the early years of World War II, the film stars Penn as a small-town teen-aged hotshot, six weeks away from being shipped out to fight overseas. In the meantime, Penn begins to date Elizabeth McGovern, whom he assumes is from a wealthy family. Penn's pal Nicolas Cage, who's gotten his girlfriend Suzanne Adkinson pregnant, imposes upon Penn to hit up McGovern for the abortion money. That's when Penn discovers that the girl barely has a penny to her name. Convinced that Penn cared for her only when he thought she was rich, McGovern walks out on him, but later teams up with Penn to help the unfortunate Adkinson. The plot is pure James Dean, a fact not lost on fans who regarded Sean Penn as the second coming of Dean. A very slight piece, Racing With the Moon is buoyed by the engaging performances of the stars, and by director Richard Benjamin's meticulous attention to period detail-especially in those peerless bowling-alley and skating-rink sequences."
  },
  {
    "name": "Birdy",
    "id": 4,
    "image": "../../img/birdy.jpg",
    "decade": "80s",
    "year": 1984,
    "rt_score": 85,
    "rt_range": "80-89",
    "director": "Alan Parker",
    "freakout": false,
    "genres": ["Drama"],
    "trailerURL": "https://www.youtube.com/embed/hfGwJGrLz2w",
    "summary": "Director Alan Parker tackles this adapation of William Wharton's novel, which retains much of the source material's texture and complexity. Matthew Modine is Birdy, who comes back from Vietnam mentally shattered and deludes himself into thinking that he is a bird, an animal that has obsessed him since childhood. Birdy is confined to a military hospital, where he spends his time sitting naked in his room, not acknowleding anyone, moving and acting like a parakeet. His best friend Al (Nicolas Cage), also a wounded Vietnam vet, visits Birdy every day, determined to bring him back to reality. Birdy is occasionally disjointed but enriched by strong performances from Modine and Cage and a number of hard-to-forget moments."
  },
  {
    "name": "The Boy in Blue",
    "id": 5,
    "image": "../../img/the-boy-in-blue.jpg",
    "decade": "80s",
    "year": 1986,
    "rt_score": "Unavailable",
    "rt_range": "null",
    "director": "Charles Jarrot",
    "freakout": false,
    "genres": ["Drama"],
    "trailerURL": "https://www.youtube.com/embed/I1vc2MdwTj8",
    "summary": "To fully appreciate Boy in Blue, it's helpful to know a little bit about the sport of \"sculling,\"or competitive rowing. Nicolas Cage stars as the real-life Ned Hanlan, who at the turn of the century was Canada's foremost sculling champ. A wild, uncontrollable youth, Hanlan is \"adopted\" by a gambler named Bill (David Naughton), who promotes the boy on the sculling circuit for his own monetary gain. Ruthlessly businessman Knox (Christopher Plummer) assumes control of Hanlan's career, but when Ned discovers just how ruthless Knox can be, he casts his lot with the first honest man he's met, inventor-speculator Walter (Sean Sullivan). Hanlan's professional success is capped by his marriage to Margaret (Cynthia Dale), Knox's previously unattainable niece. The by-the-numbers Boy in Blue was given an R rating due to a few disposable sex scenes, thereby cutting its potential audience (hero-worshipping youths) in half."
  },
  {
    "name": "Peggy Sue Got Married",
    "id": 6,
    "image": "../../img/peggy-sue-got-married.jpg",
    "decade": "80s",
    "year": 1986,
    "rt_score": "85",
    "rt_range": "80-89",
    "director": "Francis Ford Coppola",
    "freakout": false,
    "genres": ["Comedy", "Drama", "Fantasy", "Romance"],
    "trailerURL": "https://www.youtube.com/embed/jwfZWOLGJiw",
    "summary": "During her 25th high school class reunion, middle-aged Peggy Sue (Kathleen Turner) tries to forget her marital problems with husband Charlie (Nicolas Cage) by renewing old friendships. Wondering if she made the right decisions in her life, Peggy Sue gets a chance to try again when, zapped into a time warp, she finds herself a teenager back in 1960. Armed with foreknowledge (the scene in which she tells off her algebra teacher is a particular treat), Peggy Sue gets to retrace the steps leading up to her unhappy marriage to high-school sweetheart Charlie. Will nerdish Richard Norvik (Barry Miller), who always carried a torch for Peggy Sue and whom she knows will become a millionaire computer mogul by 1985, win out over the unreliable Charlie this time? A \"small\" film from the otherwise profligate Francis Ford Coppola, Peggy Sue Got Married possesses an irresistible charm that makes up for its glaring plot deficiencies. The youthful cast is matched in its appeal by such veterans as Leon Ames, Maureen O'Sullivan and John Carradine. And yes, that is Jim Carrey as Walter Getz."
  },
  {
    "name": "Raising Arizona",
    "id": 7,
    "image": "../../img/raising-arizona.jpg",
    "decade": "80s",
    "year": 1987,
    "rt_score": "91",
    "rt_range": "90-100",
    "director": "Joel Coen",
    "freakout": false,
    "genres": ["Comedy"],
    "trailerURL": "https://www.youtube.com/embed/OjWu8i6eMZo",
    "summary": "Combining influences from Tex Avery cartoons to Sam Raimi horror movies to 1940s B-movies, Joel Coen and Ethan Coen followed up the stylish film noir of their debut, Blood Simple (1984), with this frantic screwball comedy. H.I. \"Hi\" McDonnough (Nicholas Cage) is a philosophical but slightly dim career criminal who has been arrested so often that he gets to know \"Ed,\" short for Edwina (Holly Hunter), the officer who takes his mug shots. Hi takes a shine to Ed and promises to go straight if she marries him. She accepts, and they move to the Arizona desert, where Hi holds down a factory job and blissfully watches the sunsets with Ed. Their serenity is shattered when the couple decides that they want a child and discover that, as Hi puts it, \"Ed's womb was a rocky place where my seed could find no purchase.\" (One of the film's many delights is Hi's unexpectedly flowery dime-novel narration.) Ed goes into a severe depression until she sees an item in the news. Nathan Arizona (Trey Wilson), owner of a chain of unpainted furniture stores, has become the father of quintuplets, and he and his wife joke that they now have more children than they know what to do with. In what seems like a perfect \"helps you, helps me\" situation, Hi and Ed kidnap one of the Arizona infants, figuring that they'll have a baby and the Arizonas will have less of a burden."
  },
  {
    "name": "Moonstruck",
    "id": 8,
    "image": "../../img/moonstruck.jpg",
    "decade": "80s",
    "year": 1987,
    "rt_score": "93",
    "rt_range": "90-100",
    "director": "Norman Jewison",
    "freakout": true,
    "genres": ["Comedy", "Romance", "Drama"],
    "trailerURL": "https://www.youtube.com/embed/M01_2CKL6PU",
    "summary": "When there's a full moon over Brooklyn, anything can happen, and everything happens in the neighborhood where widowed bookkeeper Loretta Castorini (Cher) lives. First, Loretta agrees to marry a man she does not love, Johnny Cammareri (Danny Aiello), simply because he knows how to propose properly. Before the wedding can take place, Cammareri must visit his dying mother in Sicily. In his absence, Loretta is supposed to try to patch up the differences between Johnny and his brother, bakery operator Ronny Cammareri (Nicolas Cage). Having never forgiven Johnny for indirectly causing the accident that crippled him, Ronny flies into a rage whenever his brother's name is mentioned. He does, however, fall for Loretta like a ton of bricks. After a torrid affair, Loretta tries to avoid Ronny out of respect to Johnny, but he's just too fascinating to resist. Meanwhile, Loretta's father (Vincent Gardenia) is fooling around with his mistress Mona (Anita Gillette), while Loretta's mother (Olympia Dukakis) is wooed by a college professor (John Mahoney). These brief flings are forgiven and forgotten, but there's still the delicate situation of Loretta being in love with her future brother-in-law. A now-classic romantic comedy, Moonstruck won Oscars for Cher, Olympia Dukakis, and screenwriter John Patrick Shanley."
  },
  {
    "name": "Vampire's Kiss",
    "id": 9,
    "image": "../../img/vampires-kiss.jpg",
    "decade": "80s",
    "year": 1989,
    "rt_score": "61",
    "rt_range": "60-69",
    "director": "Robert Bierman",
    "freakout": true,
    "genres": ["Comedy", "Horror"],
    "trailerURL": "https://www.youtube.com/embed/kKWqUsyQofg",
    "summary": "Peter Loew (Nicolas Cage), a sleazy NYC literary agent, prowls the bars in the evening looking for some action. One night he hooks up with Rachel (Jennifer Beals), and in the course of their relations, she bites him on the neck. When he wakes up the next morning, Peter doesn't feel quite right. He is irritable, and has a hard time dealing with life at the literary agency, where his secretary takes the brunt of his ire. Suddenly, it dawns on Peter that he was bitten by a vampire, so he goes out and buys a set of real fangs. Then the chaos begins."
  },
  {
    "name": "Time to Kill",
    "id": 10,
    "image": "../../img/time-to-kill.jpg",
    "decade": "80s",
    "year": 1989,
    "rt_score": "Unavailable",
    "rt_range": null,
    "director": "Giuliano Montaldo",
    "freakout": false,
    "genres": ["Drama"],
    "trailerURL": "https://www.youtube.com/embed/lGoPfm1G7Qc",
    "summary": "A young soldier in Africa (Nicholas Cage) wanders away from his camp and meets a woman whom he rapes and kills. But when he returns to his outfit he finds he can't escape his tormenting conscience. [If your interest is piqued, check out the \"trailer\" for a surprise.]"
  },
  {
    "name": "Fire Birds",
    "id": 11,
    "image": "../../img/fire-birds.jpg",
    "decade": "90s",
    "year": 1990,
    "rt_score": 10,
    "rt_range": "Rotten",
    "director": "David Green",
    "freakout": false,
    "genres": ["Action"],
    "trailerURL": "https://www.youtube.com/embed/cuZaAOtQfp8",
    "summary": "Nicolas Cage stars in the below-par action film Firebirds -- a dying ember from Reagan-era nationalistic jingoism. In this Top Gun retread, Cage plays Jake Preston, a hotshot Army helicopter pilot who is being trained to use the U.S. Army's Apache aircraft to destroy the drug fields of a South American drug cartel. It up to his taskmaster instructor Brad Little (Tommy Lee Jones) to teach Jake humble lessons before he can be trusted to launch into the skies against the drug dealers. While Jake is trying to tame his egoism, he engages in a torrid love affair with flying ace Billie Lee Guthrie (Sean Young). The film was originally titled Wings of the Apache for the U.S. Army Apache assault helicopters that are prominently displayed in the film."
  },
  {
    "name": "Wild at Heart",
    "id": 12,
    "image": "../../img/wild-at-heart.jpg",
    "decade": "90s",
    "year": 1990,
    "rt_score": 65,
    "rt_range": "60-69",
    "director": "David Lynch",
    "freakout": true,
    "genres": ["Comedy", "Drama", "Romance", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/dQIdBfrF0Ik",
    "summary": "Sailor Ripley (Cage) and Lula Pace Fortune (Dern), a young couple from Cape Fear, North Carolina, go on the run from Lula's domineering mother and the gangsters she hires to kill Sailor. On the way they encounter a plethora of grotesques and stop for plenty of explicit sex."
  },
  {
    "name": "Zandalee",
    "id": 13,
    "image": "../../img/zandalee.jpg",
    "decade": "90s",
    "year": 1991,
    "rt_score": 33,
    "rt_range": "Rotten",
    "director": "Sam Pillsbury",
    "freakout": false,
    "genres": ["Drama"],
    "trailerURL": "https://www.youtube.com/embed/bRYq09bzrOc",
    "summary": "In this thriller, poet Thierry Martin (Judge Reinhold) takes over the family business, abandoning both his art and his sex life, much to the dismay of his wife, Zandalee (Erika Anderson). However, when Thierry's painter friend Johnny Collins (Nicolas Cage) comes to town, his fling with Zandalee could prove more complicated than he imagined."
  },
  {
    "name": "Honeymoon in Vegas",
    "id": 14,
    "image": "../../img/honeymoon-in-vegas.jpg",
    "decade": "90s",
    "year": 1992,
    "rt_score": 63,
    "rt_range": "60-69",
    "director": "Andrew Bergman",
    "freakout": false,
    "genres": ["Comedy", "Romance"],
    "trailerURL": "https://www.youtube.com/embed/MbrZBvSUMkM",
    "summary": "On her deathbed, a mother makes her son promise never to get married, which scars him with psychological blocks to a commitment with his girlfriend. They finally decide to tie the knot in Vegas, but a wealthy gambler arranges for the man to lose $65K in a poker game and offers to clear the debt for a weekend with his fiancée. Suddenly the man is insanely jealous, and pursues his fiancée and her rich companion, but finds pitfalls in his path as the gambler tries to delay his interference."
  },
  {
    "name": "Amos & Andrew",
    "id": 15,
    "image": "../../img/amos-and-andrew.jpg",
    "decade": "90s",
    "year": 1993,
    "rt_score": 20,
    "rt_range": "Rotten",
    "director": "E. Max Frye",
    "freakout": false,
    "genres": ["Comedy", "Action"],
    "trailerURL": "https://www.youtube.com/embed/II4lMyaIcug",
    "summary": "When the cops in a lily-white resort town mistake a wealthy black author for a burglar, the local police chief recruits a drifter to help with the cover-up. This attempted satire of race relations ultimately becomes a standard odd couple comedy contrasting uptight, upper-class black Andrew and poor white Amos."
  },
  {
    "name": "Deadfall",
    "id": 16,
    "image": "../../img/deadfall.jpg",
    "decade": "90s",
    "year": 1993,
    "rt_score": 0,
    "rt_range": "Rotten",
    "director": "Christopher Coppola",
    "freakout": true,
    "genres": ["Drama", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/E1kbITvaV7Y",
    "summary": "This lushly photographed, contemporary film noir tries to substitute looks and unconvincing, contrived plot twists for substance, capturing the look of a film noir but lacking the depth and characterization needed to make the film work. After his father, Mike is killed, Joe Donan (Michael Biehn) finds evidence that his Uncle Lou (James Coburn) in a dual role as Mike and Lou, might have stolen money from his father. Joe hooks up with Lou and his drug-taking lackey, Eddie (Nicolas Cage). Joe also falls for Eddie's beautiful, but devious girlfriend Diane (Sarah Trigger). Joe kills Eddie and gains Lou's confidence, joining him in a diamond swindle. As the unnecessarily complicated plot concludes, Joe learns the shocking truth that he himself has been the victim of a scam. Michael Biehn while a good-looking and competent actor, fails to find the depth necessary to bring his outwardly sophisticated but surprisingly naive character to life. Sarah Trigger is too shallow to make a convincing noir femme-fatale, and her obvious deviousness would fool only the most gullible. Nicolas Cage, in a totally over-the-top performance also fails to give his character any believability or depth. Director Christopher Coppola takes a potentially interesting premise and muddles it with too many plot twists and unconvincing performances."
  },
  {
    "name": "Red Rock West",
    "id": 17,
    "image": "../../img/red-rock-west.jpg",
    "decade": "90s",
    "year": 1993,
    "rt_score": 95,
    "rt_range": "90-100",
    "director": "John Dahl",
    "freakout": false,
    "genres": ["Drama", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/F2KRMMazpxg",
    "summary": "An offbeat mystery about an average guy who is mistaken for a professional hit-man. Dead tired and flat broke after driving 1,200 miles, Michael, an unemployed Texan, walks into a tavern in tiny Red Rock West, Wyoming, and is immediately offered a job. There's just one problem: the owner thinks Micheal is a hit-man, and the \"job\" is murdering the owner's wife. Just when Mike decides to take the money and run, the real hit-man arrives, ready to do the job right."
  },
  {
    "name": "Guarding Tess",
    "id": 18,
    "image": "../../img/guarding-tess.jpg",
    "decade": "90s",
    "year": 1994,
    "rt_score": 57,
    "rt_range": "Rotten",
    "director": "Hugh Wilson",
    "freakout": false,
    "genres": ["Drama", "Comedy", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/pSIa0ofR-Bg",
    "summary": "This comedy offers a combination of humor, drama, and thrills as it follows the tumultuous relationship between a young Secret Service agent assigned to protect the feisty widow of a U.S. president. Straight arrow agent Doug Chesnic has been guarding widow Tess Carlisle for three years. He is ecstatic when he is finally transferred to a new assignment. Just when it finally looks as if he will escape for good, he is reassigned to Tess' Ohio home. He breaks down and tells them it is the worst assignment there is. Unfortunately, he doesn't have a choice so he grudgingly returns to the high-handed ex-First Lady. He begins his stint with a clear discussion of his duties as presented in his service handbook which Tess blithely ignores. The mulish two engage in a minor power struggle, but when she is kidnapped, agent Chesnic winds up showing his true feelings for her."
  },
  {
    "name": "It Could Happen to You",
    "id": 19,
    "image": "../../img/it-could-happen-to-you.jpg",
    "decade": "90s",
    "year": 1994,
    "rt_score": 71,
    "rt_range": "70-79",
    "director": "Andrew Bergman",
    "freakout": false,
    "genres": ["Drama", "Comedy", "Romance"],
    "trailerURL": "https://www.youtube.com/embed/8ZAfzdzZqRA",
    "summary": "Loosely based on a true story, this uneven romantic comedy depicts the unexpected way in which a winning lottery ticket unites a pair of strangers. Waitress Yvonne (Bridget Fonda) first meets police officer Charlie (Nicolas Cage) when he eats in her restaurant. Realizing that he doesn't have enough money to give her a tip, Charlie promises Yvonne to split any winnings from the lottery ticket he just bought. The skeptical Yvonne dismisses Charlie as just another cheapskate until he wins four million dollars and, much to Yvonne's surprise, decides to honor the agreement. His action becomes front page news and wins public acclaim, but it doesn't go over nearly so well with Charlie's wife Muriel (Rosie Perez), who has her own plans for the money. Muriel's shallow, greedy behavior disgusts Charlie, who finds himself spending more and more time with Yvonne, developing a friendship that threatens to blossom into something more. Jane Anderson's screenplay stresses the relationship between Charlie and Yvonne's characters over the situation's comic potential; this earnest tone will please romance fans but may disappoint viewers expecting the farcical comedy of writer/director Andrew Bergman's and Cage's previous effort, Honeymoon in Vegas."
  },
  {
    "name": "Trapped in Paradise",
    "id": 20,
    "image": "../../img/trapped-in-paradise.jpg",
    "decade": "90s",
    "year": 1994,
    "rt_score": 10,
    "rt_range": "Rotten",
    "director": "George Gallo",
    "freakout": false,
    "genres": ["Comedy"],
    "trailerURL": "https://www.youtube.com/embed/gkMtJacbGs0",
    "summary": "Three brothers who are inept criminals butcher one last attempt to pull off a big heist in this caper comedy. Bill Firpo (Nicolas Cage) is sick of thievery and has retired from crime to run an upscale restaurant in New York. But when his two brothers, Alvin (Dana Carvey) and Dave (Jon Lovitz), get out of prison, Bill is sucked back into their world of crime. The three end up on the run and hide out in the small town of Paradise, PA. The friendly townspeople include a bank president (Clifford Moffat) whose trust in people has left his bank an easy target. The brothers can't resist lifting $275,000 from the vault. Unfortunately, Alvin drives their getaway car in circles and they end up back in town and get in an accident."
  },
  {
    "name": "Kiss of Death",
    "id": 21,
    "image": "../../img/kiss-of-death.jpg",
    "decade": "90s",
    "year": 1995,
    "rt_score": 68,
    "rt_range": "60-69",
    "director": "Barbara Schroeder",
    "freakout": false,
    "genres": ["Action", "Drama", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/OzDKmB6bfQQ",
    "summary": "A loyal family man who has had trouble with the law is released from prison on the condition that he help the government spy on Little Junior, a major crime lord. This noirish thriller follows the ex-con's efforts to befriend the crime boss and keep his identity as an informant secret."
  },
  {
    "name": "Leaving Las Vegas",
    "id": 22,
    "image": "../../img/leaving-las-vegas.jpg",
    "decade": "90s",
    "year": 1995,
    "rt_score": 90,
    "rt_range": "90-100",
    "director": "Mike Figgis",
    "freakout": true,
    "genres": ["Drama", "Romance"],
    "trailerURL": "https://www.youtube.com/embed/Ke6kU0rD8Jg",
    "summary": "\"We both know that I'm a drunk and you're a hooker,\" Ben (Nicolas Cage) reminds Sera (Elisabeth Shue). The unusual twist in this critically acclaimed drama is the lovers' mutual agreement not to try to change one another. Nick Cage won the \"Best Actor\" Oscar as a depressive alchoholic determined to drink himself to death."
  },
  {
    "name": "The Rock",
    "id": 23,
    "image": "../../img/the-rock.jpg",
    "decade": "90s",
    "year": 1996,
    "rt_score": 66,
    "rt_range": "60-69",
    "director": "Michael Bay",
    "freakout": false,
    "genres": ["Action"],
    "trailerURL": "https://www.youtube.com/embed/jGVJx5mOtL8",
    "summary": "The sophomore film from former music video and commercial director Michael Bay, this fast-paced action yarn featured rapid-fire editing, a cutting-edge rock soundtrack and liberal use of shots awash in a haze of burnished hues, all trademarks of producers Don Simpson and Jerry Bruckheimer. Nicolas Cage stars as Stanley Goodspeed, an FBI chemical weapons expert handed a unique assignment. Francis X. Hummel (Ed Harris), an insane Marine Corps general, has taken 81 tourists hostage on the abandoned island prison of Alcatraz. He and his men are threatening to bomb San Francisco with deadly gas unless $100 million is paid in war reparations to the families of servicemen killed in covert operations. Goodspeed is teamed with former British spy John Patrick Mason (Sean Connery), the only man ever to escape \"The Rock,\" as well as a Navy SEAL team. When their military escorts are ambushed, it's up to odd couple Goodspeed and Mason to break into Alcatraz and stop Hummel. The Rock was the last film produced by Simpson, who died of a drug overdose before the film's release. Solo, his partner Bruckheimer continued making the sort of glossy, frenetic films for which the duo was famed."
  },
  {
    "name": "Con Air",
    "id": 24,
    "image": "../../img/con-air.jpg",
    "decade": "90s",
    "year": 1997,
    "rt_score": 55,
    "rt_range": "Rotten",
    "director": "Simon West",
    "freakout": false,
    "genres": ["Action"],
    "trailerURL": "https://www.youtube.com/embed/WXgcE6_xfR0",
    "summary": "Former war hero Cameron Poe (Nicolas Cage) is sentenced to eight years in prison when he accidentally kills a man in a barroom brawl while defending his pregnant wife. When his release comes through, he's eager to see the daughter he's never met. However, Poe's original flight is delayed, so he's put aboard a flight transporting ten of the most dangerous men in the American penal system to a new high-security facility. One of the criminals, Cyrus \"The Virus\" Grissom (John Malkovich), is a serial killer and insane genius who has hatched a diabolical plot: with the help of several other hoods, including Diamond Dog (Ving Rhames), Johnny 23 (Daniel Trejo), and Garland Greene (Steve Buscemi), Cyrus and his men will hijack the plane and fly to a neutral nation where they can live as free men. Poe finds himself stuck in the middle; he has to find a way to get home, keep himself alive, look after his cellmate Baby-O (Mykelti Williamson), who will die without proper medicine, and try to help the cops on the ground, including agent Vince Larkin (John Cusack). Producer Jerry Bruckheimer's first film after the death of his partner Don Simpson, Con Air shows he learned well how to assemble the formula all by himself, with plenty of action, stunts, and special effects and not a lot of story to get in the way."
  },
  {
    "name": "Face/Off",
    "id": 25,
    "image": "../../img/face-off.jpg",
    "decade": "90s",
    "year": 1997,
    "rt_score": 92,
    "rt_range": "90-100",
    "director": "John Woo",
    "freakout": true,
    "genres": ["Sci-Fi", "Action"],
    "trailerURL": "https://www.youtube.com/embed/95VvTW1FvS8",
    "summary": "In order to foil a terrorist plot, an FBI agent (John Travolta) undergoes a facial transplant surgery and assumes the identity and physical appearance of a terrorist (Nicolas Cage), but the plan turns from bad to worse when the same terrorist impersonates the FBI agent."
  },
  {
    "name": "City of Angels",
    "id": 26,
    "image": "../../img/city-of-angels.jpg",
    "decade": "90s",
    "year": 1998,
    "rt_score": 58,
    "rt_range": "Rotten",
    "director": "Brad Silberling",
    "freakout": false,
    "genres": ["Drama", "Fantasy", "Romance"],
    "trailerURL": "https://www.youtube.com/embed/mwWL8cB2Ix8",
    "summary": "A loose remake of Wim Wenders' 1987 film Wings of Desire (Der Himmel über Berlin), which was set in Berlin. As with the original, City of Angels tells the story of an angel (Cage) who falls in love with a mortal woman (Ryan), and wishes to become human in order to be with her. With the guidance of a man (Dennis Franz) who has already made the transition from immortality, the angel falls and discovers the human experience."
  },
  {
    "name": "Snake Eyes",
    "id": 27,
    "image": "../../img/snake-eyes.jpg",
    "decade": "90s",
    "year": 1998,
    "rt_score": 22,
    "rt_range": "Rotten",
    "director": "Brian De Palma",
    "freakout": false,
    "genres": ["Action", "Drama", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/xzewDVXmSII",
    "summary": "Brian De Palma directed this taut thriller, set in Atlantic City, where a corrupt cop investigates a political assassination. Outside an Atlantic City arena-hotel-casino, a TV news reporter stands in a pre-hurricane storm to report on the heavyweight boxing match about to begin inside. A transition to the stadium interior focuses on Atlantic City homicide Detective Rick Santoro (Nicolas Cage), a father with a wife and son, yet also a dishonest cop who maintains a mistress and cheerfully accepts bribes. DePalma's Steadicam follows Santoro on a fast-paced tour of the stadium as the laughing, yelling detective travels stairs and hallways, talks to a gal with a between-rounds placard, visits the dressing room of champ Lincoln Tyler (Stan Shaw), rides down an escalator to squeeze money from a small-time hood, enters the arena of 14,000 fight fans, talks on his phone with his girlfriend and wife, and sits ringside next to his lifelong buddy, Navy Cmdr. Kevin Dunne (Gary Sinise). Behind Dunne, the U.S. Secretary of Defense Charles Kirkland (Joel Fabiani) is seated alongside billionaire casino owner Gilbert Powell (John Heard). As the fight gets underway, Dunne abandons his position protecting the defense chief to pursue a suspicious redhead. From his ringside vantage point, Santoro has a close view of the champ, curiously conscious despite taking a kayo punch. At that moment, an assassin fires at Kirkland. Santoro immediately concocts a good cover story for his pal (to explain why Dunne left his post protecting Kirkland). Just after the shooting, Dunne kills a Palestinian extremist, the apparent killer, and Santoro orders the stadium doors locked, hoping he can locate other suspects among the fleeing crowd. One such is Julia Costello (Carla Gugino), an injured woman in a blond wig who spoke with Kirkland seconds before the gunfire. After a video replay reveals the champ took a fall, going down to the floor from a punch that never touched him, Santoro becomes more curious and suspicious, comparing witness accounts, and he attempts to locate Julia, convinced she's the key to truth behind the assassination. As it all comes to a head, Santoro peels through successive layers of corruption, ultimately confronting himself in a self-examination of his own values. Filmed at Montreal's old Forum."
  },
  {
    "name": "8mm",
    "id": 28,
    "image": "../../img/8mm.jpg",
    "decade": "90s",
    "year": 1998,
    "rt_score": 40,
    "rt_range": "Rotten",
    "director": "Joel Schumacher",
    "freakout": false,
    "genres": ["Action", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/mjIGbTTw3i8",
    "summary": "Tom Welles is a surveillance specialist-what used to be known as a \"private eye\"-but his version of the profession is hardly the stuff of which legends are made. He has a modest, home-based practice in Harrisburg, Pennsylvania, where he lives an existence remarkable only for its normalcy with wife Amy and baby daughter, Cindy. Respected but still waiting for a big break that will improve his professional status, Welles spends most of his time on routine cases involving unfaithful spouses and the like. Nothing too dangerous, nor too threatening... until a small, innocuous-looking plastic reel of film turns Welles' life upside down, sending him down a sordid and terrifying path into society's darkest corners. From the lurid sidewalks of L.A.'s Hollywood Boulevard to the squalor of New York City's meat-packing district, Eight Millimeter follows Welles as he relentlessly pursues a bizarre trail of graphic and disturbing evidence to determine the fate of a complete stranger-a girl who begins to haunt his imagination and conscience. Aided in his obsession by a streetwise adult bookstore clerk, Max (Joaquin Phoenix), Welles drifts away from his wife, family and former life. What Welles learns is beyond his worst nightmares, as he comes to realize how deadly a small reel of eight millimeter film can be."
  },
  {
    "name": "Bringing Out the Dead",
    "id": 29,
    "image": "../../img/bringing-out-the-dead.jpg",
    "decade": "90s",
    "year": 1998,
    "rt_score": 72,
    "rt_range": "70-79",
    "director": "Martin Scorcese",
    "freakout": false,
    "genres": ["Drama", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/8TMg9WlKgsU",
    "summary": "Nicolas Cage plays EMS paramedic Frank Pierce. It is the early 1990's and New York has not yet undergone its renaissance of recent years. Surrounded by the injured and the dying, Frank is dwelling in an urban night-world, crumbling under the accumulated weight of too many years of saving and losing lives. The film follows Frank over the course of fifty-six hours in his life - two days and three nights on the job - as he reaches the very brink of spiritual collapse and redemption."
  },
  {
    "name": "Gone in 60 Seconds",
    "id": 30,
    "image": "../../img/gone-in-60-seconds.jpg",
    "decade": "00s",
    "year": 2000,
    "rt_score": 25,
    "rt_range": "Rotten",
    "director": "Dominic Sena",
    "freakout": false,
    "genres": ["Action"],
    "trailerURL": "https://www.youtube.com/embed/1xUlBooeVgs",
    "summary": "In this action thriller, a master car thief has his skills pushed to the limit. Randall \"Memphis\" Raines (Nicolas Cage) can steal practically any car that crosses his path. While he has done well in his life of crime, he knows that there's a short future in theft, and he wants to get out of the business. But his retirement plans are interrupted when his younger brother Kip (Giovanni Ribisi) gets in trouble with a dangerous crime boss. To get his brother out of harm's way, Randall agrees to a profitable but risky scheme to steal 50 luxury cars in one night, with the help of several other car thieves, including Sara \"Sway\" Wayland (Angelina Jolie). A rival group of thieves is trying to pull the same stunt at the same time, and detectives Castlebeck (Delroy Lindo) and Drycoff (Timothy Olyphant) are trying to shut down both operations. Also starring Robert Duvall as Otto Halliwell, and Scott Caan as Tumbler, Gone in Sixty Seconds is a remake of the 1974 low-budget action hit of the same name, best remembered for a 40-minute chase scene in which 90 cars were destroyed."
  },
  {
    "name": "The Family Man",
    "id": 31,
    "image": "../../img/the-family-man.jpg",
    "decade": "00s",
    "year": 2000,
    "rt_score": 53,
    "rt_range": "Rotten",
    "director": "Brett Ratner",
    "freakout": false,
    "genres": ["Comedy", "Drama", "Fantasy", "Romance"],
    "trailerURL": "https://www.youtube.com/embed/OnouJoQs52c",
    "summary": "Wall Street playboy, Jack Campbell is at the top of his professional game with little time for anything else. Jack's lavish, fast-paced lifestyle drastically changes one snowy Christmas night when he unwittingly stumbles into the middle of a grocery store holdup and in a bold display of self-preservation disarms the gunman. The next morning he wakes up in a suburban New Jersey bedroom lying next to Kate, his college sweetheart who he left in order to pursue his career, and to the horrifying discovery that his former life no longer exists. As he stumbles through this alternate suburban universe, Jack begins to feel strangely comfortable in this new role of loving husband and father to two children. Jack finds himself at a crossroad, where he must choose between his high-powered career and the woman he loves."
  },
  {
    "name": "Captain Corelli's Mandolin",
    "id": 32,
    "image": "../../img/captain-corellis-mandolin.jpg",
    "decade": "00s",
    "year": 2001,
    "rt_score": 28,
    "rt_range": "Rotten",
    "director": "John Madden",
    "freakout": false,
    "genres": ["Drama", "Romance"],
    "trailerURL": "https://www.youtube.com/embed/xjjGrxipPGQ",
    "summary": "During World War II, an Italian officer, Captain Corelli, is put in command of a garrison that's occupying the Greek island of Cephallonia. After a beautiful local woman's fiance--a fisherman--departs to fight with the Greek army, she falls in love with Corelli who becomes torn between his own love for her and his political allegiances."
  },
  {
    "name": "Windtalkers",
    "id": 33,
    "image": "../../img/windtalkers.jpg",
    "decade": "00s",
    "year": 2002,
    "rt_score": 32,
    "rt_range": "Rotten",
    "director": "John Woo",
    "freakout": false,
    "genres": ["Drama"],
    "trailerURL": "https://www.youtube.com/embed/xjjGrxipPGQ",
    "summary": "Loosely based on a real-life operation during World War II, this action-adventure from director John Woo stars Nicolas Cage as Joe Enders, a Marine traumatized by the loss of his entire platoon in the Solomon Islands during an ambush he believes was deadlier than necessary due to his indecision. Suffering from eardrum damage in Hawaii, Joe manages to be declared fit for duty once again thanks to a sympathetic nurse (Frances O'Connor), but his new assignment isn't what he expects. Joe is ordered to safeguard a Navajo soldier named Ben Yahzee (Adam Beach) because the military has developed a new secret code based on the near-dead Navajo language that is proving unbreakable to the Japanese. Any soldier that speaks Navajo is an immediate asset, including Ben and his pal, Charlie Whitehorse (Roger Willie). Joe's orders are to\"babysit\" Ben during the invasion of Saipan, protecting him if possible, but -- if the code-talker's capture becomes imminent -- to kill him before he falls into enemy hands. Meanwhile, Charlie is to be guarded by affable harmonica player Ox Henderson (Christian Slater). Joe reluctantly accepts this new duty as a way to get back into the war, and in the ensuing carnage, his nearly suicidal acts of bravery make him a hero while Ben becomes paralyzed by fear. Determined to live up to Joe's example, Ben musters up his courage, even in the face of racism from a fellow soldier (Noah Emmerich), and ends up rescuing his own protector behind enemy lines by briefly posing as a Japanese soldier. Despite their growing mutual respect, Joe is eventually forced to take an action that threatens to shatter his bond with Ben, as the war's tragic losses strike closer to home for both men. Windtalkers co-stars Peter Stormare, Jason Isaacs, and Mark Ruffalo."
  },
  {
    "name": "Adaptation",
    "id": 34,
    "image": "../../img/adaptation.jpg",
    "decade": "00s",
    "year": 2002,
    "rt_score": 91,
    "rt_range": "90-100",
    "director": "Spike Jonze",
    "freakout": false,
    "genres": ["Drama", "Comedy"],
    "trailerURL": "https://www.youtube.com/embed/BMwOEkTmTyQ",
    "summary": "Despite the success of his first produced script, \"Being John Malkovich,\" for which he received an Academy Award nomination for best original screenplay, Charlie Kaufman is plagued by insecurities, both in his career and his personal life. When he is hired to adapt \"The Orchid Thief,\" a nonfiction book about a fanatical orchid breeder, John Laroche, he is completely stumped. Though, on the surface, the book is about Laroche's flower poaching adventures in the Florida Everglades, on another level it's also about the desire in all of us to experience passion. This longing plagues the book's author, Susan Orlean and, Charlie realizes, himself as well. Charlie's twin brother, Donald Kaufman, only makes things worse when he moves in with Charlie and announces he's going to be a screenwriter too. As Charlie battles his severe case of writer's block, Donald cheerily types away on a script about a serial killer with multiple-personality disorder. Donald's script immediately sells, making him the \"hot\" new writer in town. Then, one day, Charlie has a last ditch inspiration. He'll use his own dilemma as a framework for the script about Laroche and Orlean. But as the words start to flow, and the story takes shape, Charlie inadvertently sets in motion a chain of events impacting on the lives of all the characters."
  },
  {
    "name": "Matchstick Men",
    "id": 35,
    "image": "../../img/matchstick-men.jpg",
    "decade": "00s",
    "year": 2003,
    "rt_score": 82,
    "rt_range": "80-89",
    "director": "Ridley Scott",
    "freakout": true,
    "genres": ["Drama", "Comedy"],
    "trailerURL": "https://www.youtube.com/embed/zDoOdd00nHM",
    "summary": "Ridley Scott directs the crime comedy Matchstick Men, based on the novel of the same name by Eric Garcia. Neurotic con man Roy (Nicolas Cage) suffers from several emotional problems, including obsessive-compulsive disorder. He and his partner Frank (Sam Rockwell) swindle people out of money by posing as money collectors who promise things like tax refunds, package vacations, and other fabulous prizes (which they never get). Frank wants to pull a really big job, but Roy is too consumed with fear and panic attacks to join him. Only cigarettes and his trusty illegal prescription drugs seem to keep him going. When Roy finds himself in desperate need of more pills, he is forced to see legitimate psychotherapist Dr. Klein (Bruce Altman). Roy ends up talking about his emotional damage from a troubled marriage and divorce, which results in the discovery of a child whom he has never met. Dr. Klein suggests that he spend a weekend with the kid, so in walks teenaged Angela (played by twentysomething Alison Lohman). Reluctant to develop his role as a father, Roy also gets heavily involved in Frank's ambitious swindle."
  },
  {
    "name": "National Treasure",
    "id": 36,
    "image": "../../img/national-treasure.jpg",
    "decade": "00s",
    "year": 2004,
    "rt_score": 46,
    "rt_range": "Rotten",
    "director": "Jon Turteltaub",
    "freakout": false,
    "genres": ["Action"],
    "trailerURL": "https://www.youtube.com/embed/I0u9-5lPP4Q",
    "summary": "Benjamin Franklin Gates (Nicolas Cage) is a third generation treasure hunter. All his life, Gates has been searching for a treasure no one believed existed: amassed through the ages, moved across continents, to become the greatest treasure the world has ever known. Hidden by our Founding Fathers, they left clues to the Treasure's location right before our eyes--from our nation's birthplace, to the nation's capitol, to clues buried within the symbols on the dollar bill. Gates' life-long journey leads him to the last place anyone thought to look: a map hidden on the back of the Declaration of Independence. But what he thought was the final clue is only the beginning. Gates realizes in order to protect the world's greatest treasure, he must now do the unthinkable: steal the most revered, best guarded document in American history before it falls into the wrong hands. In a race against time, Gates must elude the authorities, stay one step ahead of his ruthless adversary, decipher the remaining clues and unlock the 2000 year-old mystery behind our greatest national treasure."
  },
  {
    "name": "Lord of War",
    "id": 37,
    "image": "../../img/lord-of-war.jpg",
    "decade": "00s",
    "year": 2005,
    "rt_score": 62,
    "rt_range": "60-69",
    "director": "Andrew Niccol",
    "freakout": false,
    "genres": ["Action", "Drama", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/Ej83QvHuiNI",
    "summary": "One man demonstrates how to get rich selling warring nations the tools of their deadly trade in this dark comedy drama. Yuri Orlov (Nicolas Cage) is an opportunistic businessman who stumbled into a gold mine after the end of the Cold War and the collapse of the Soviet Union. Huge caches of Soviet weapons became available at bargain prices (and even for free if one wasn't above stealing), and as literally billions of dollars' worth of Soviet military technology disappeared, it began finding its way into the hands of weapons dealers eager to sell it to the highest bidder. Orlov was one such dealer who found plenty of buyers for guns and military gear in unstable Third World nations, who paid cash and didn't appreciate too many questions. Orlov's exploits in the arms business quickly made him a very rich man, but they've also led to some unwanted attention from Jack Valentine (Ethan Hawke), an Interpol agent who is convinced Orlov isn't playing by the rules. Inspired by a true story, Lord of War also features Jared Leto, Ian Holm, Bridget Moynahan, and Donald Sutherland."
  },
  {
    "name": "The Weather Man",
    "id": 38,
    "image": "../../img/the-weather-man.jpg",
    "decade": "00s",
    "year": 2005,
    "rt_score": 59,
    "rt_range": "Rotten",
    "director": "Gore Verbinski",
    "freakout": false,
    "genres": ["Comedy", "Drama"],
    "trailerURL": "https://www.youtube.com/embed/vZIIKsnM6MM",
    "summary": "A man struggles to get a grip on a life that's spinning out of control in this emotional comedy drama. Dave Spritz (Nicolas Cage) is a television weatherman on a high-profile Chicago news program. Professionally, Dave is doing just fine -- he makes great money for a job that demands little effort, and he has a shot at an assignment with a network morning news and chat show. But Dave's personal life leaves a lot to be desired -- his father, respected author Robert Spritzel (Michael Caine), is in failing health, he's divorced from his wife, Noreen (Hope Davis), and his relationship with his children is tenuous at best, especially his overweight daughter, Shelly (Gemmenne de la Pena). If Dave is to land his new job, he'll have to move to New York City, and with his time in Chicago running short, he dedicates himself to trying to salvage his ties with his family before it's too late, though he discovers this is even harder than he imagines."
  },
  {
    "name": "The Ant Bully",
    "id": 39,
    "image": "../../img/the-ant-bully.jpg",
    "decade": "00s",
    "year": 2006,
    "rt_score": 62,
    "rt_range": "60-69",
    "director": "John A. Davis",
    "freakout": false,
    "genres": ["Comedy", "Drama"],
    "trailerURL": "https://www.youtube.com/embed/Mn_bNixJa3k",
    "summary": "The Ant Bully tells a witty and heartwarming story about a 10-year-old boy who embarks on a remarkable journey. New in town, friendless and tormented by a neighborhood bully, young Lucas Nickle has been taking out his frustration on the innocent ant hill in his yard. But one day the ants retaliate. Using a magic potion, they shrink Lucas down to ant size and sentence him to live like an ant in their colony. In this strange new world Lucas will learn important lessons about friendship, get a whole new perspective on life and ultimately find the courage to stand up for himself."
  },
  {
    "name": "World Trade Center",
    "id": 40,
    "image": "../../img/world-trade-center.jpg",
    "decade": "00s",
    "year": 2006,
    "rt_score": 67,
    "rt_range": "60-69",
    "director": "Oliver Stone",
    "freakout": false,
    "genres": ["Drama"],
    "trailerURL": "https://www.youtube.com/embed/Hhd8ecoc4EE",
    "summary": "Director Oliver Stone once again offers a powerful and provocative story based on real-life events in this drama. Sergeant John McLoughlin (Nicolas Cage) and William J. Jimeno (Michael Peña) were two officers assigned to New York City's Port Authority who were working their beats on a quiet day in early fall when they received an emergency call. The day was September 11, 2001, and McLoughlin and Jimeno were among the policemen who attempted to evacuate the World Trade Center towers after they were struck by airliners piloted by terrorists. World Trade Center was based on the true story of John McLoughlin and William J. Jimeno, both of whom cooperated with producers in the making of this film."
  },
  {
    "name": "The Wicker Man",
    "id": 41,
    "image": "../../img/the-wicker-man.jpg",
    "decade": "00s",
    "year": 2006,
    "rt_score": 15,
    "rt_range": "Rotten",
    "director": "Neil LaBute",
    "freakout": true,
    "genres": ["Action", "Drama", "Horror", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/tlvqLOo6apM",
    "short_summary": "A sheriff investigating the disappearance of a young girl from a small island discovers there's a larger mystery to solve among the island's secretive, neo-pagan community.",
    "summary": "A young child has gone missing and it's up to a haunted but determined policeman to travel to the remote island community where she was last seen and solve the lingering mystery of her disappearance in director Neil LaBute's updated reworking of Anthony Shaffer's 1973 cult horror classic. Upon receiving a letter from his one-time fiancée, Willow (Kate Beahan), imploring him to search for her missing daughter on the secluded island of Summersisle, Policeman Edward Malus (Nicolas Cage) quickly makes his way to the island to locate the girl and seek an answer as to why Willow suddenly and inexplicably disappeared shortly before their wedding date. Once there, Malus is troubled to discover that although there are traces of the child to be found in such locations as the local schoolhouse, the residents of Summersisle seem reluctant to offer any specific details as to the girl's apparent death. His investigation effectively stalled by the highly secretive Wiccan community, Sheriff Malus soon discovers that there are still some cultures that have their own unique beliefs about humankind's relationship with Mother Earth, and refuse to adapt to the rules of modern society."
  },
  {
    "name": "Ghost Rider",
    "id": 42,
    "image": "../../img/ghost-rider.jpg",
    "decade": "00s",
    "year": 2007,
    "rt_score": 26,
    "rt_range": "Rotten",
    "director": "Mark Steven Johnson",
    "freakout": false,
    "genres": ["Action", "Suspense", "Fantasy"],
    "trailerURL": "https://www.youtube.com/embed/8M0lLJfNPds",
    "short_summary": "When motorcycle rider Johnny Blaze sells his soul to the Devil to save his father's life, he is transformed into the Ghost Rider, the Devil's own bounty hunter, and is sent to hunt down sinners.",
    "summary": "When a motorcycle-riding stuntman offers his soul to Mephistopheles in order to save the life of the one he loves most, he is forced to play host to a powerful supernatural entity whose flaming skull visage strikes fear into the heart of his enemies in this feature-film version of the long-running comic series. By day, Johnny Blaze (actor and comic-book devotee Nicolas Cage) is one of the world's best-known stuntmen, but when the sun goes down and he is in the presence of evil, the death-defying daredevil bursts into flames to become the indestructible, motorcycle-riding antihero known to the world as the Ghost Rider."
  },
  {
    "name": "Next",
    "id": 43,
    "image": "../../img/next.jpg",
    "decade": "00s",
    "year": 2007,
    "rt_score": 28,
    "rt_range": "Rotten",
    "director": "Lee Tamahori",
    "freakout": false,
    "genres": ["Suspense", "Sci-Fi"],
    "trailerURL": "https://www.youtube.com/embed/fsb4Q37CfTI",
    "short_summary": "A Las Vegas magician who can see into the future is pursued by FBI agents seeking to use his abilities to prevent a nuclear terrorist attack.",
    "summary": "A man with the ability to see the future and change the outcome of events before they occur is forced to choose between saving himself and saving the world in this supernatural thriller starring Nicolas Cage and directed by Lee Tamahori (Die Another Day, The Edge). Cris Johnson (Cage) is a Las Vegas magician who possesses the unique ability to witness the events of the immediate future moments before they happen. As a child Cris was subjected to a series of cruel experiments by government scientists and doctors, but a change of name and a new identity allowed the tortured psychic to elude detection and start a new life away from the prying eyes of his former captors. Though his clairvoyant vision only extends a few minutes into the future, it has still allowed Cris to eke out a living as a low-rent Las Vegas magician while earning a little extra cash at the blackjack tables. Up to this point in his life Cris has never used his power for anything substantial, but when he experiences a vision of Los Angeles being incinerated in a nuclear holocaust, the small-time magician realizes that he could hold the key to saving millions of lives. But as low as he has tried to lie in recent years, Cris has never completely escaped detection by the government. Now, as terrorists prepare to unleash the ultimate horror on an unsuspecting city, FBI counter terror agent Callie Ferris (Julianne Moore) sets out to capture Cris and convince him to use his exceptional gift to prevent the nuclear nightmare from becoming a terrifying reality. Jessica Biel, Peter Falk, and Thomas Kretschmann co-star in the film, which is based on a short story by acclaimed sci-fi author Philip K. Dick."
  },
  {
    "name": "National Treasure: Book of Secrets",
    "id": 44,
    "image": "../../img/national-treasure-2.jpg",
    "decade": "00s",
    "year": 2007,
    "rt_score": 36,
    "rt_range": "Rotten",
    "director": "Jon Turteltaub",
    "freakout": true,
    "genres": ["Action"],
    "trailerURL": "https://www.youtube.com/embed/pDxiflW57r4",
    "short_summary": "Benjamin Gates must follow a clue left in John Wilkes Booth's diary to prove his ancestor's innocence in the assassination of Abraham Lincoln.",
    "summary": "In this adventure-filled sequel to the 2004 blockbuster National Treasure, Nicolas Cage reprises his role as artifact hunter and archaeologist extraordinaire Ben Franklin Gates. In this outing, Gates learns of his own family's implication in the assassination of Abraham Lincoln by John Wilkes Booth. Gates must then locate an elusive diary, not only to clear his family's name, but to unearth and connect several secrets, buried within the book, that point to a massive, global conspiracy. The film co-stars Jon Voight, Harvey Keitel, and Helen Mirren as Ben's mother. Jerry Bruckheimer returns as producer."
  },
  {
    "name": "Bangkok Dangerous",
    "id": 45,
    "image": "../../img/bangkok-dangerous.jpg",
    "decade": "00s",
    "year": 2008,
    "rt_score": 8,
    "rt_range": "Rotten",
    "director": "The Pang Brothers",
    "freakout": false,
    "genres": ["Action", "Drama", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/s6qZKGcrk_M",
    "short_summary": "A hitman who's in Bangkok to pull off a series of jobs violates his personal code when he falls for a local woman and bonds with his errand boy.",
    "summary": "The life of an anonymous assassin takes an unexpected turn when he travels to Thailand to complete a series of contract killings. Joe a remorseless hitman, is in Bangkok to execute four enemies of a ruthless crime boss named Surat. He hires Kong, a street punk and pickpocket, to run errands for him with the intention of covering his tracks by killing him at the end of the assignment. Strangely, Joe, the ultimate lone wolf, instead finds himself mentoring the young man while simultaneously being drawn into a tentative romance with a local shop girl. As he falls further under the sway of Bangkok's intoxicating beauty, Joe begins to question his isolated existence and let down his guard ...just as Surat decides it's time to clean house."
  },
  {
    "name": "Knowing",
    "id": 46,
    "image": "../../img/knowing.jpg",
    "decade": "00s",
    "year": 2009,
    "rt_score": 33,
    "rt_range": "Rotten",
    "director": "Alex Proyas",
    "freakout": false,
    "genres": ["Sci-Fi", "Drama", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/C2zSFElhgE0",
    "short_summary": "M.I.T. professor John Koestler links a mysterious list of numbers from a time capsule to past and future disasters and sets out to prevent the ultimate catastrophe.",
    "summary": "A time capsule containing a cryptic message about the coming apocalypse sends a concerned father on a race to prevent the horrific events from unfolding as predicted in this sci-fi thriller directed by Alex Proyas (Dark City) and starring Nicolas Cage. 1958: As the dedication ceremony for a newly constructed elementary school gets under way, a time capsule containing student drawings of the future is buried on the grounds and scheduled to be unearthed on the school's 50th anniversary. Instead of submitting a drawing, however, one little girl scribbles a series of seemingly random numbers on her paper before it is buried. Fifty years later, the time capsule is unearthed for a new generation of students to examine. Young Caleb Koestler (Chandler Canterbury) is one of those students. The mysterious sequence of numbers falling into his possession, Caleb takes the paper to his father, Professor John Koestler (Cage), for examination. Studying the numbers, Professor Koestler soon discovers that they aren't random at all, but an encoded message containing the precise dates, death tolls, and coordinates of every major disaster since the time capsule was buried. Not only that, but the document also indicates that there will be three more such events, the last of which indicates a doomsday scenario that appears directly tied to Professor Koestler and Caleb. His desperate plea to authorities falling on deaf ears, Professor Koestler realizes that his only hope for preventing more lives from being lost is to take personal action. Though the author of the prophecies is no longer living, Professor Koestler is eventually able to track down her daughter Diana Wayland (Rose Byrne), and granddaughter Abby, who reluctantly agree to aid in the investigation. As the final date on the list draws near, Professor Koestler enters into a frantic race against time to prevent destruction on a global scale, in the process realizing that in order to save millions of lives, he may have to make the ultimate sacrifice."
  },
  {
    "name": "G-Force",
    "id": 47,
    "image": "../../img/g-force.jpg",
    "decade": "00s",
    "year": 2009,
    "rt_score": 22,
    "rt_range": "Rotten",
    "director": "Hoyt Y. Yeatman, Jr.",
    "freakout": false,
    "genres": ["Sci-Fi", "Action", "Comedy"],
    "trailerURL": "https://www.youtube.com/embed/VAMUfDvAQeo",
    "short_summary": "A specially trained squad of guinea pigs is dispatched to stop a diabolical billionaire from taking over the world.",
    "summary": "G-FORCE is a comedy-adventure about the latest evolution of a covert government program to train animals to work in espionage. Armed with the latest high-tech spy equipment, these highly trained guinea pigs discover that the fate of the world is in their paws. Tapped for the G-FORCE are guinea pigs Darwin, the squad leader determined to succeed at all costs; Blaster, an outrageous weapons expert with tons of attitude and a love for all things extreme; and Juarez, a sexy martial arts pro; plus the literal fly-on-the-wall reconnaissance expert, Mooch, and a star-nosed mole, Speckles, the computer and information specialist. Along the way, the G-FORCE encounters myriad other members of the animal kingdom, including pet shop layabout Hurley and the rabidly territorial hamster Bucky."
  },
  {
    "name": "Astro Boy",
    "id": 48,
    "image": "../../img/astro-boy.jpg",
    "decade": "00s",
    "year": 2009,
    "rt_score": 50,
    "rt_range": "Rotten",
    "director": "David Bowers",
    "freakout": false,
    "genres": ["Sci-Fi", "Action"],
    "trailerURL": "https://www.youtube.com/embed/1AhqOHom9BY",
    "short_summary": "When an android replica of a boy is rejected by his aggrieved creator, he goes off to find his own identity in an adventure that would make him the greatest hero of his time.",
    "summary": "A young robot with incredible powers, super strength, and the purest spirit on the planet discovers the joys of being human while embarking on a worldwide journey to discover his true potential in this animated update of Osamu Tezuka's classic anime story. Astro Boy (Freddie Highmore) is a young robot from futuristic Metro City. Created by a brilliant scientist named Tenma (Nicolas Cage), and powered by pure positive \"blue\" energy that gives him such abilities as x-ray vision, inhuman speed, and flight, the wide-eyed android longs to find his true place in the world. He sets out on an epic journey that brings him face to face with an underworld army of robots and some of the strangest creatures ever to walk the Earth, and along the way learns to experience human feelings and emotions. Astro Boy's remarkable mission of discovery is suddenly cut short, however, when he learns that his friends and family back in Metro City are in grave danger. As Astro Boy prepares to face off against his greatest adversary in order to save everything he cares most about, he realizes that only through victory will he finally discover what it takes to be a hero."
  },
  {
    "name": "Bad Lieutenant: Port of Call New Orleans",
    "id": 49,
    "image": "../../img/bad-lieutenant.jpg",
    "decade": "00s",
    "year": 2009,
    "rt_score": 85,
    "rt_range": "80-89",
    "director": "Warner Herzog",
    "freakout": true,
    "genres": ["Drama", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/2N5UcZJHy4g",
    "short_summary": "Terence McDonagh is a drug- and gambling-addled detective in post-Katrina New Orleans investigating the killing of five Senegalese immigrants.",
    "summary": "Abel Ferrara's cult crime drama Bad Lieutenant is given a sister film with this Werner Herzog-helmed production that takes its inspiration from the original, but focuses on new characters and plotlines. Nicolas Cage steps into Harvey Keitel's mold of a corrupt and drug-addled police officer, with the scummy setting moving from New York City to New Orleans. Eva Mendes, Val Kilmer, and Xzibit co-star."
  },
  {
    "name": "Kick-Ass",
    "id": 50,
    "image": "../../img/kick-ass.jpg",
    "decade": "10s",
    "year": 2010,
    "rt_score": 76,
    "rt_range": "70-79",
    "director": "Matthew Vaughn",
    "freakout": false,
    "genres": ["Action", "Comedy", "Drama"],
    "trailerURL": "https://www.youtube.com/embed/Xeoj9r1hUKY",
    "short_summary": "Dave Lizewski is an unnoticed high school student and comic book fan who one day decides to become a superhero, even though he has no powers, training or meaningful reason to do so.",
    "summary": "Adapted from Mark Millar's hyper-violent comic book of the same name, director Matthew Vaughn's (Layer Cake) vigilante superhero film tells the tale of an average New York teenager who decides to don a costume and fight crime. Comic book geek Dave Lizewski (Aaron Johnson) may not have good coordination or special powers, but that doesn't mean he isn't a fully capable crime fighter. After purchasing a flashy wet suit on the Internet, Dave starts busting up baddies with nothing but brute force. He calls himself Kick-Ass, and he can take a beating as good as he can dish one out. Before long, Kick-Ass has become a local sensation, and others are following his lead. Big Daddy (Nicolas Cage) and Hit-Girl (Chloe Moretz) are a father-daughter crime-fighting duo who have set their sights on local mob heavy Frank D'Amico (Mark Strong). They're doing a decent job of dismantling Frank's sizable underworld empire when Kick-Ass gets drawn into the fray. But Frank's men play rough, and his son, Chris (Christopher Mintz-Plasse), is about to become Kick-Ass' very first arch nemesis. When Chris assumes the persona of Red Mist, the stage is set for a superhero showdown that could spell the end of Kick-Ass once and for all."
  },
  {
    "name": "The Sorceror's Apprentice",
    "id": 51,
    "image": "../../img/the-sorcerors-apprentice.jpg",
    "decade": "10s",
    "year": 2010,
    "rt_score": 40,
    "rt_range": "Rotten",
    "director": "Jon Turteltaub",
    "freakout": false,
    "genres": ["Action", "Comedy", "Drama", "Fantasy"],
    "trailerURL": "https://www.youtube.com/embed/v2uV0_1C4UM",
    "short_summary": "Master sorcerer Balthazar Blake must find and train Merlin's descendant to defeat dark sorceress Morgana la Fée.",
    "summary": "Inspired by the beloved segment of the Walt Disney classic Fantasia, The Sorcerer's Apprentice moves the setting of the story to modern-day Manhattan, where decidedly average teen Dave Stutler (Jay Baruchel) hones his magical powers under the tutelage of master sorcerer Balthazar Blake (Nicolas Cage). Malevolent wizard Maxim Horvath (Alfred Molina) is determined to claim New York City as his own. And Horvath isn't alone in his diabolical endeavor, because by joining forces with the sinister sorcerer, pop illusionist Drake Stone (Toby Kebbell) aspires to gain powers beyond his wildest imagination. Realizing that he can't take on Horvath and Stone alone, Blake recruits Stutler as his reluctant assistant and begins training him the battle that will determine the fate of the Big Apple. Teresa Palmer and Monica Bellucci co-star."
  },
  {
    "name": "Season of the Witch",
    "id": 52,
    "image": "../../img/season-of-the-witch.jpg",
    "decade": "10s",
    "year": 2011,
    "rt_score": 11,
    "rt_range": "Rotten",
    "director": "Dominic Sena",
    "freakout": false,
    "genres": ["Fantasy", "Action", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/uSbWTgIoz4g",
    "short_summary": "Fourteenth century knights transport a suspected witch to a monastery, where monks deduce her powers could be the source of the Black Plague.",
    "summary": "Nicolas Cage and Ron Perlman star in this supernatural action-adventure about a heroic Crusader and his fellow soldier who must transport a woman accused of being a witch to a remote monastery. The arduous journey across perilous terrain tests their strength and courage as they discover the girl's secret and find themselves battling a terrifyingly powerful force that will determine the fate of the world."
  },
  {
    "name": "Drive Angry",
    "id": 53,
    "image": "../../img/drive-angry.jpg",
    "decade": "10s",
    "year": 2011,
    "rt_score": 47,
    "rt_range": "Rotten",
    "director": "Patrick Lussier",
    "freakout": false,
    "genres": ["Action", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/jouaan70m4c",
    "short_summary": "A vengeful father escapes from hell and chases after the men who killed his daughter and kidnapped his granddaughter.",
    "summary": "Nicolas Cage headlines this high-octane thriller as Milton, a hard-case felon who breaks out of Hell to prevent the cult that murdered his daughter from sacrificing his infant granddaughter to Satan on the night of the full moon. With just three days to go before the ritual killing, Milton crosses paths with knockout waitress Piper (Amber Heard), who steals her cheating ex-boyfriend's vintage Charger and joins him on his quest to save the Earth from the forces of darkness. With Piper's help and a mean set of wheels to keep them moving, they may have a shot at taking down diabolical cult leader Jonah King (Billy Burke) before he achieves his malevolent goal. But should Jonah get the opportunity to make his dark sacrifice, he will become the most powerful man alive and all of humanity will suffer. Unfortunately for Milton, the cops are quickly closing in, and the Devil's determined minion, \"The Accountant\" (William Fichtner), will stop at nothing to drag him back down to Hell. With each passing minute, Milton's last shot at redemption is fading, and the fate of the entire world inches ever closer to infernal darkness."
  },
  {
    "name": "Trespass",
    "id": 54,
    "image": "../../img/trespass.jpg",
    "decade": "10s",
    "year": 2011,
    "rt_score": 10,
    "rt_range": "Rotten",
    "director": "Joel Schumacher",
    "freakout": false,
    "genres": ["Drama", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/1rolBdc_mjs",
    "short_summary": "As they're held for ransom, a husband and wife's predicament grows more dire amid the discovery of betrayal and deception.",
    "summary": "In a private, wealthy community, priority is placed on security and no exception is made for the Miller family's estate. Behind their pristine walls and manicured gardens, Kyle (Nicolas Cage), a fast-talking businessman, has entrusted the mansion's renovation to his stunning wife, Sarah (Nicole Kidman). But between making those big decisions and keeping tabs on their defiant teenage daughter (Liana Liberato), Sarah often finds herself distracted by a young, handsome worker (Cam Gigandet) at their home. Nothing is what it seems, and it will take a group of cold-blooded criminals led by Elias (Ben Mendelsohn), who have been planning a vicious home invasion for months, to bring the Miller family together. Kyle, Sarah and Avery will take the ultimate risk to make it out with their lives - and their family - intact."
  },
  {
    "name": "Seeking Justice",
    "id": 55,
    "image": "../../img/seeking-justice.jpg",
    "decade": "10s",
    "year": 2011,
    "rt_score": 27,
    "rt_range": "Rotten",
    "director": "Roger Donaldson",
    "freakout": false,
    "genres": ["Action", "Drama", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/Pu0UcoCsV8A",
    "short_summary": "After his wife is assaulted, a husband enlists the services of a vigilante group to help him settle the score. Then he discovers they want a \"favor\" from him in return.",
    "summary": "A happily married family man's quiet life is turned upside-down when his wife is brutally attacked one night while leaving work. The husband unwittingly pulls himself into a dangerous underground vigilante operation after agreeing to an intriguing offer for a stranger to exact vengeance on is wife's attacker. While continuing to protect his wife from the truth, he quickly discovers that his quest for justice could lead to frightening and deadly consequences."
  },
  {
    "name": "Ghost Rider: Spirit of Vengeance",
    "id": 56,
    "image": "../../img/ghost-rider-2.jpg",
    "decade": "10s",
    "year": 2012,
    "rt_score": 18,
    "rt_range": "Rotten",
    "director": "Neveldine/Taylor",
    "freakout": false,
    "genres": ["Action", "Fantasy", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/ZFHyPLaENRE",
    "short_summary": "Johnny Blaze, tortured by the Ghost Rider's curse, gets a chance of redemption through protecting the Devil's son, whose father is pursuing him.",
    "summary": "Nicolas Cage reprises his role as Johnny Blaze in Ghost Rider Spirit of Vengeance. In this gritty new vision for the character, directed by Neveldine/Taylor (Crank), Johnny is still struggling with his curse as the devil's bounty hunter - but he may risk everything as he teams up with the leader of a group of rebel monks (Idris Elba) to save a young boy from the devil... and possibly rid himself of his curse forever."
  },
  {
    "name": "Stolen",
    "id": 57,
    "image": "../../img/stolen.jpg",
    "decade": "10s",
    "year": 2012,
    "rt_score": 20,
    "rt_range": "Rotten",
    "director": "Simon West",
    "freakout": false,
    "genres": ["Action", "Drama", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/rpMxOjUjweA",
    "short_summary": "A former thief frantically searches for his missing daughter, who has been kidnapped and locked in the trunk of a taxi.",
    "summary": "Will Montgomery (Nicolas Cage) is a master thief who after being double-crossed in a heist gone awry is sent to prison for 8 years. Upon his release he's ready to leave his criminal past behind and try to rebuild a relationship with his estranged daughter Allison. The FBI and his old cohorts believe that he hid the loot from the last heist 8 years ago, $10 Million in Bonds. To get his hands on it, his old partner Vincent kidnaps Allison and demands the entire $ 10 Million as ransom. Montgomery only has one day to get the $10 Million ransom but much to the disbelief of the FBI on his trail and Vincent, Will doesn't actually have it. Instead, he must trust his instincts and his old partner in crime, the beautiful, sexy and smart Riley, to do one more, clever heist to get his daughter back alive before it's too late."
  },
  {
    "name": "The Croods",
    "id": 58,
    "image": "../../img/the-croods.jpg",
    "decade": "10s",
    "year": 2013,
    "rt_score": 71,
    "rt_range": "70-79",
    "director": "Kirk DeMicco, Chris Sanders",
    "freakout": false,
    "genres": ["Action", "Comedy"],
    "trailerURL": "https://www.youtube.com/embed/4fVCKy69zUY",
    "short_summary": "After their cave is destroyed, a caveman family must trek through an unfamiliar fantastical world with the help of an inventive boy.",
    "summary": "The Croods tells the story of the world's first family road trip. When their cave is destroyed, the Crood family must embark on a comedy adventure into strange and spectacular territory in search of a new home. As if patriarch Grug (Nicolas Cage) didn't already have enough to handle, it goes from bad to worse when they encounter an imaginative nomad named Guy (Ryan Reynolds.) With Guy's help the Croods conquer their fear of the outside world and discover that they have exactly what it takes to survive: each other."
  },
  {
    "name": "The Frozen Ground",
    "id": 59,
    "image": "../../img/the-frozen-ground.jpg",
    "decade": "10s",
    "year": 2013,
    "rt_score": 61,
    "rt_range": "60-69",
    "director": "Scott Walker",
    "freakout": false,
    "genres": ["Drama", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/GZSo12hMuKE",
    "short_summary": "An Alaska State Trooper partners with a young woman who escaped the clutches of serial killer Robert Hansen to bring the murderer to justice. Based on actual events.",
    "summary": "The Frozen Ground is inspired by the incredible true story that follows Alaskan State Trooper Jack Halcombe (Nicolas Cage) as he sets out to end the murderous rampage of Robert Hansen (John Cusack), a serial killer who has gone unnoticed for 13 years. As the bodies of street girls start to pile up in Anchorage, fear strikes a chord with the public. Risking his life, Halcombe goes on a personal manhunt to find the killer before the next body surfaces. When a seventeen year old escapee (Vanessa Hudgens) reveals key information about the case, Halcombe is finally on the trail of the killer. But will he catch him in time to save the next victim?"
  },
  {
    "name": "Joe",
    "id": 60,
    "image": "../../img/joe.jpg",
    "decade": "10s",
    "year": 2014,
    "rt_score": 85,
    "rt_range": "80-89",
    "director": "David Gordon Green",
    "freakout": false,
    "genres": ["Drama"],
    "trailerURL": "https://www.youtube.com/embed/QbWjxlhmlu0",
    "short_summary": "An ex-con, who is the unlikeliest of role models, meets a 15-year-old boy and is faced with the choice of redemption or ruin.",
    "summary": "A gripping mix of friendship, violence and redemption erupts in the contemporary South in this adaptation of Larry Brown's novel, celebrated at once for its grit and its deeply moving core. Directed by David Gordon Green, Joe brings Academy Award winner Nicolas Cage back to his indie roots in the title role as the hard-living, hot-tempered, ex-con Joe Ransom, who is just trying to dodge his instincts for trouble - until he meets a hard-luck kid, (Mud's Tye Sheridan) who awakens in him a fierce and tender-hearted protector."
  },
  {
    "name": "Rage",
    "id": 61,
    "image": "../../img/rage.jpg",
    "decade": "10s",
    "year": 2014,
    "rt_score": 12,
    "rt_range": "Rotten",
    "director": "Paco Cabezas",
    "freakout": false,
    "genres": ["Action", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/KoREt4C6l3k",
    "short_summary": "When the daughter of a reformed criminal is kidnapped, he rounds up his old crew and seeks his own brand of justice.",
    "summary": "Paul Maguire (Nicolas Cage) is a respectable businessman and loving father living peaceful life...until his violent past comes back to haunt him. When his teenage daughter is taken from their home, Paul rounds up his old crew to help him find her...by any means necessary. His search for justice leads Paul down a dark and bloody path of revenge, betrayal and long buried secrets. Danny Glover, Rachel Nichols, and Peter Stormare co-star in this heart-stopping thrill ride that shows no mercy."
  },
  {
    "name": "Left Behind",
    "id": 62,
    "image": "../../img/left-behind.jpg",
    "decade": "10s",
    "year": 2014,
    "rt_score": 1,
    "rt_range": "Rotten",
    "director": "Vic Armstrong",
    "freakout": false,
    "genres": ["Suspense"],
    "trailerURL": "https://www.youtube.com/embed/GrXe8YDbzYs",
    "short_summary": "A small group of survivors are left behind after millions of people suddenly vanish and the world is plunged into chaos and destruction.",
    "summary": "The most important event in the history of mankind is happening right now. In the blink of an eye, the biblical Rapture strikes the world. Millions of people disappear without a trace. All that remains are their clothes and belongings, and in an instant, terror and chaos spread around the world. The vanishings cause unmanned vehicles to crash and burn. Planes fall from the sky. Emergency forces everywhere are devastated. Gridlock, riots and looting overrun the cities. There is no one to help or provide answers. In a moment, the entire planet is plunged into darkness."
  },
  {
    "name": "Dying of the Light",
    "id": 63,
    "image": "../../img/dying-of-the-light.jpg",
    "decade": "10s",
    "year": 2014,
    "rt_score": 8,
    "rt_range": "Rotten",
    "director": "Paul Schrader",
    "freakout": false,
    "genres": ["Suspense", "Drama"],
    "trailerURL": "https://www.youtube.com/embed/Q48g1ijnSlI",
    "short_summary": "When a devastating illness threatens to end Evan Lake's career in the C.I.A., he goes rogue to hunt down a terrorist who tortured him during a mission gone awry years ago.",
    "summary": "Evan Lake (Cage), a veteran CIA agent, has been ordered to retire. But when his protégé (Anton Yelchin) uncovers evidence that Lake's nemesis, the terrorist Banir (Alexander Karim), has resurfaced, Lake goes rogue, embarking on a perilous, intercontinental mission to eliminate his sworn enemy."
  },
  {
    "name": "Outcast",
    "id": 64,
    "image": "../../img/outcast.jpg",
    "decade": "10s",
    "year": 2014,
    "rt_score": 5,
    "rt_range": "Rotten",
    "director": "Nick Powell",
    "freakout": false,
    "genres": ["Action"],
    "trailerURL": "https://www.youtube.com/embed/JZW2lo19MEg",
    "short_summary": "A mysterious warrior teams up with the daughter and son of a deposed Chinese Emperor to defeat their cruel brother, who seeks their deaths.",
    "summary": "When the heir of the Imperial throne becomes the target of an assassination by his despised older brother, the young prince must flee the kingdom and seek protection. His only hope for survival is a reluctant war-weary crusader named Jacob, who must overcome his own personal demons and rally the assistance of a mythical outlaw known as The White Ghost. Together they must fight side by side in an epic battle to return the prince to his rightful place on the throne."
  },
  {
    "name": "The Runner",
    "id": 65,
    "image": "../../img/the-runner.jpg",
    "decade": "10s",
    "year": 2015,
    "rt_score": 24,
    "rt_range": "Rotten",
    "director": "Austin Stark",
    "freakout": false,
    "genres": ["Drama"],
    "trailerURL": "https://www.youtube.com/embed/sG3YXUBoroM",
    "short_summary": "In the aftermath of the 2010 BP oil spill, an idealistic but flawed politician is forced to confront his dysfunctional life after his career is destroyed in a sex scandal.",
    "summary": "In the aftermath of the 2010 BP oil spill, an idealistic but imperfect New Orleans politician finds his plans of restoration unraveling as his own life becomes contaminated with corruption, scandal and deceit."
  },
  {
    "name": "Pay the Ghost",
    "id": 66,
    "image": "../../img/pay-the-ghost.jpg",
    "decade": "10s",
    "year": 2015,
    "rt_score": 10,
    "rt_range": "Rotten",
    "director": "Uli Edel",
    "freakout": false,
    "genres": ["Suspense"],
    "trailerURL": "https://www.youtube.com/embed/oVr5C4ysw3w",
    "short_summary": "A professor frantically searches for his son who was abducted during a Halloween carnival.",
    "summary": "One year after his young son disappeared during a Halloween carnival, Mike Cole is haunted by eerie images and terrifying messages he can't explain. Together with his estranged wife, he will stop at nothing to unravel the mystery and find their son - and, in doing so, he unearths a legend that refuses to remain buried in the past."
  },
  {
    "name": "The Trust",
    "id": 67,
    "image": "../../img/the-trust.jpg",
    "decade": "10s",
    "year": 2016,
    "rt_score": 63,
    "rt_range": "60-69",
    "director": "Alex Brewer, Ben Brewer",
    "freakout": true,
    "genres": ["Drama"],
    "trailerURL": "https://www.youtube.com/embed/TLspHA8m6Ac",
    "short_summary": "A pair of cops investigating a drug invasion stumble upon a mysterious bank vault.",
    "summary": "Waters and Stone are two nobody police officers working dull administrative jobs and making extra money selling stolen Civil Service Exams to other officers. When Stone hears a story about a heroin dealer quickly beating his extremely high bail, the two friends set into motion a plan to find the origin of such a large amount of cash. Through diligent police work they follow a trail that leads directly to a custom bank-style vault built into the back room freezer of a small grocery store. They put a plan into motion to rob the vault and split whatever they find inside. But by the time they figure out what the vault contains, it's already too late to turn back."
  },
  {
    "name": "Snowden",
    "id": 68,
    "image": "../../img/snowden.jpg",
    "decade": "10s",
    "year": 2016,
    "rt_score": 60,
    "rt_range": "60-69",
    "director": "Oliver Stone",
    "freakout": false,
    "genres": ["Drama"],
    "trailerURL": "https://www.youtube.com/embed/QlSAiI3xMh4",
    "short_summary": "The NSA's illegal surveillance techniques are leaked to the public by one of the agency's employees, Edward Snowden, in the form of thousands of classified documents distributed to the press.",
    "summary": "Academy Award-winning director Oliver Stone, who brought Platoon, Born on the Fourth of July, Wall Street and JFK to the big screen, tackles the most important and fascinating true story of the 21st century. Snowden, the politically-charged, pulse-pounding thriller starring Joseph Gordon-Levitt and Shailene Woodley, reveals the incredible untold personal story of Edward Snowden, the polarizing figure who exposed shocking illegal surveillance activities by the NSA and became one of the most wanted men in the world. He is considered a hero by some, and a traitor by others. No matter which you believe, the epic story of why he did it, who he left behind, and how he pulled it off makes for one of the most compelling films of the year."
  },
  {
    "name": "USS Indianapolis: Men of Courage",
    "id": 69,
    "image": "../../img/uss-indianapolis.jpg",
    "decade": "10s",
    "year": 2016,
    "rt_score": 17,
    "rt_range": "Rotten",
    "director": "Mario Van Peebles",
    "freakout": false,
    "genres": ["Drama", "Action"],
    "trailerURL": "https://www.youtube.com/embed/ZDPE-NronKk",
    "short_summary": "During World War II, an American navy ship is sunk by a Japanese submarine leaving 890 crewmen stranded in shark infested waters.",
    "summary": "Nic Cage, Tom Sizemore and Tom Jane star in the harrowing tale of real life American heroes shipwrecked in shark infested waters in the waning days of World War II."
  },
  {
    "name": "Dog Eat Dog",
    "id": 70,
    "image": "../../img/dog-eat-dog.jpg",
    "decade": "10s",
    "year": 2016,
    "rt_score": 51,
    "rt_range": "Rotten",
    "director": "Paul Schrader",
    "freakout": false,
    "genres": ["Suspense", "Action"],
    "trailerURL": "https://www.youtube.com/embed/zvweaacTsTI",
    "short_summary": "A crew of ex-cons are hired by a Cleveland mafioso to kidnap the baby of a rival mobster.",
    "summary": "Legendary filmmaker Paul Schrader directs this \"sordid and engaging crime drama\" (The Hollywood Reporter) starring Nicolas Cage and Willem Dafoe. Ex-cons Troy (Cage), Mad Dog (Dafoe) and Diesel (Christopher Matthew Cook) are hired by an eccentric mob boss to kidnap a baby for a large ransom. When the abduction goes awry, the trio find themselves on the run from the mob and the cops. Vowing to stay out of prison at all costs, getting away with the crime is literally a matter of life and death."
  },
  {
    "name": "Army of One",
    "id": 71,
    "image": "../../img/army-of-one.jpg",
    "decade": "10s",
    "year": 2016,
    "rt_score": 25,
    "rt_range": "Rotten",
    "director": "Larry Charles",
    "freakout": false,
    "genres": ["Comedy"],
    "trailerURL": "https://www.youtube.com/embed/RYsPEl-xOv0",
    "short_summary": "After a personal visit by God himself, the eccentric construction worker Gary Faulkner takes the decision to embark on an adventure in the badlands of Pakistan to bring Al-Qaeda's leader Osama Bin Laden to justice.",
    "summary": "Gary Faulkner (Cage) is an ex-con, unemployed handyman, and modern day Don Quixote who receives a vision from God (Brand) telling him to capture Osama Bin Laden. Armed with only a single sword purchased from a home-shopping network, Gary travels to Pakistan to complete his mission. While on his quest, Gary encounters old friends back home in Colorado, the new friends he makes in Pakistan, the enemies he makes at the CIA - and even God and Osama themselves."
  },
  {
    "name": "Arsenal",
    "id": 72,
    "image": "../../img/arsenal.jpg",
    "decade": "10s",
    "year": 2017,
    "rt_score": 3,
    "rt_range": "Rotten",
    "director": "Steven C. Miller",
    "freakout": true,
    "genres": ["Action"],
    "trailerURL": "https://www.youtube.com/embed/YnYnxWrnCu8",
    "short_summary": "A Southern mobster attempts to rescue his kidnapped brother.",
    "summary": "A powerful action thriller, Arsenal tells the intertwining stories of the Lindel brothers, Mikey (Johnathon Schaech) and JP (Adrian Grenier), who had only each other to rely on growing up. As adults, JP found success as the owner of a construction company, while Mikey became a small-time mobster, mired in a life of petty crime. When Mikey is kidnapped and held for a ransom by ruthless crime boss Eddie King (Nicolas Cage, reprising his role from 1993's Deadfall), JP turns to the brothers' old pal Sal (John Cusack), a plainclothes detective, for help. In order to rescue his brother, JP must risk everything and unleash his vengeance against King's relentless army of gangsters."
  },
  {
    "name": "Mom and Dad",
    "id": 73,
    "image": "../../img/mom-and-dad.jpg",
    "decade": "10s",
    "year": 2017,
    "rt_score": 75,
    "rt_range": "70-79",
    "director": "Brian Taylor",
    "freakout": true,
    "genres": ["Comedy", "Horror"],
    "trailerURL": "https://www.youtube.com/embed/sPVicWnq_BU",
    "short_summary": "A teenage girl and her little brother must survive a wild 24 hours during which a mass hysteria of unknown origins causes parents to turn violently on their own kids.",
    "summary": "A strange disorder suddenly causes parents to violently turn against their own children, forcing a suburban teen (Anne Winters) and her younger brother (Zackary Arthur) to evade the clutches of their now-deranged mom (Selma Blair) and dad (Nicolas Cage). However, their situation gets even more complicated when their grandparents (Lance Henriksen and Marilyn Dodds Frank) show up for a visit. Written and directed by Brian Taylor (Crank, Gamer)."
  },
  {
    "name": "Vengeance: A Love Story",
    "id": 74,
    "image": "../../img/vengeance.jpg",
    "decade": "10s",
    "year": 2017,
    "rt_score": "Unavailable",
    "rt_range": "Rotten",
    "director": "Johnny Martin",
    "freakout": false,
    "genres": ["Action", "Suspense"],
    "trailerURL": "https://www.youtube.com/embed/oWHUlhEkP1Y",
    "short_summary": "A group of strangers come to the aid of a single mother seeking to bring her rapists to justice.",
    "summary": "On the Fourth of July, single mother Teena is brutally assaulted by a local gang in front of her 12-year-old daughter Bethie. Even though Bethie is able to identify the attackers, the defense hires a local hot-shot defense attorney who manipulates the law to their advantage. When the criminals are set free, Gulf War veteran and detective John Dromoor (Nicolas Cage) is dismayed by the lack of justice and plots revenge against the men on Teena's behalf."
  },
  {
    "name": "Inconceivable",
    "id": 75,
    "image": "../../img/inconceivable.jpg",
    "decade": "10s",
    "year": 2017,
    "rt_score": 31,
    "rt_range": "Rotten",
    "director": "Jonathan Baker",
    "freakout": false,
    "genres": ["Suspense"],
    "trailerURL": "https://www.youtube.com/embed/vse9mg7AnGM",
    "short_summary": "A mother looks to escape her abusive past by moving to a new town where she befriends another mother, who grows suspicious of her.",
    "summary": "A mysterious young woman, Katie (Nicky Whelan), and her daughter move to a new town to escape her past and quickly befriends Angela Morgan (Gina Gershon), a mother of one who longs for a bigger family. As their lives become intricately entwined, Angela and her husband, Brian, (Nicolas Cage), invite Katie to live in their guest-house to serve as their nanny. Over time, the blossoming friendship between the two women spirals into a dangerous obsession as Katie becomes overly attached to the Morgans' daughter. Enduring lies and manipulations, Angela and Brian realize that sweet Katie is actually trying to destroy their family from within."
  },
  {
    "name": "Looking Glass",
    "id": 76,
    "image": "../../img/looking-glass.jpg",
    "decade": "10s",
    "year": 2018,
    "rt_score": 17,
    "rt_range": "Rotten",
    "director": "Tim Hunter",
    "freakout": false,
    "genres": ["Suspense"],
    "trailerURL": "https://www.youtube.com/embed/N9ryKS8TrDY",
    "short_summary": "A couple buy a desert motel where they find that strange, mysterious events occur.",
    "summary": "After losing their daughter to a tragic accident, shattered couple Ray and Maggie purchase a motel in the middle of nowhere in the hopes of starting a new life. But Ray begins to notice strange goings-on, and starts to piece together the history of a bizarre murder associated with the motel. Poking around in a basement one day, Ray discovers a crawl space, which leads to a two-way mirror into one of the rooms. As he becomes obsessed with the unusual activities that happen beyond the looking glass, his marriage, sanity and his very life are threatened."
  },
  {
    "name": "The Humanity Bureau",
    "id": 77,
    "image": "../../img/the-humanity-bureau.jpg",
    "decade": "10s",
    "year": 2018,
    "rt_score": 25,
    "rt_range": "Rotten",
    "director": "Rob W. King",
    "freakout": false,
    "genres": ["Action", "Sci-Fi"],
    "trailerURL": "https://www.youtube.com/embed/nb29-EyUOrI",
    "short_summary": "A dystopian thriller set in the year 2030 that sees the world in a permanent state of economic recession and facing serious environmental problems as a result of global warming.",
    "summary": "In the near future climate change has wreaked havoc in parts of the American Midwest. In its attempt to take hold of an economic recession, a government agency called the Humanity Bureau exiles members of society deemed unproductive and banishes them to a colony known as New Eden. An ambitious and impartial caseworker Noah Kross (Nicolas Cage) investigates a case appealed by a single mother Rachel Weller (Sarah Lind) and her son Lucas (Jakob Davies). Knowing the unjust fate of the innocent boy and against the wishes of his superior Adam Westinghouse (Hugh Dillon), Kross sets off to save the lives of the mother and child and to expose the truth about the Humanity Bureau's secrets once and for all."
  },
  {
    "name": "211",
    "id": 78,
    "image": "../../img/211.jpg",
    "decade": "10s",
    "year": 2018,
    "rt_score": 5,
    "rt_range": "Rotten",
    "director": "York Shackleton",
    "freakout": false,
    "genres": ["Action", "Drama"],
    "trailerURL": "https://www.youtube.com/embed/wKBFCPAGNo4",
    "short_summary": "While on a routine patrol, an aging cop, his partner and their ride-along get caught in a standoff with a band of former mercenaries robbing a bank.",
    "summary": "Inspired by one of the longest and bloodiest real-life events in police history. Officer Mike Chandler (Nicolas Cage) and a young civilian passenger find themselves under-prepared and outgunned when fate puts them squarely in the crosshairs of a daring bank heist in progress by a fearless team of highly trained and heavily armed men."
  },
  {
    "name": "Teen Titans Go! To the Movies",
    "id": 79,
    "image": "../../img/teen-titans.jpg",
    "decade": "10s",
    "year": 2018,
    "rt_score": 91,
    "rt_range": "90-100",
    "director": "Aaron Horvath, Peter Rida Michail",
    "freakout": false,
    "genres": ["Action"],
    "trailerURL": "https://www.youtube.com/embed/wKBFCPAGNo4",
    "short_summary": "A villain's maniacal plan for world domination sidetracks five teenage superheroes who dream of Hollywood stardom.",
    "summary": "When the Teen Titans go to the big screen, they go big! \"Teen Titans GO! to the Movies\" finds our egocentric, wildly satirical Super Heroes in their first feature film extravaganza - a fresh, gleefully clever, kid-appropriately crass and tongue-in-cheek play on the superhero genre, complete with musical numbers. It seems to the Teens that all the major superheroes out there are starring in their own movies everyone but the Teen Titans, that is! But de facto leader Robin is determined to remedy the situation, and be seen as a star instead of a sidekick. If only they could get the hottest Hollywood film director to notice them. With a few madcap ideas and a song in their heart, the Teen Titans head to Tinsel Town, certain to pull off their dream. But when the group is radically misdirected by a seriously super villain and his maniacal plan to take over the Earth, things really go awry. The team finds their friendship and their fighting spirit failing, putting the very fate of the Teen Titans themselves on the line!"
  },
  {
    "name": "Mandy",
    "id": 80,
    "image": "../../img/mandy.jpg",
    "decade": "10s",
    "year": 2018,
    "rt_score": 91,
    "rt_range": "90-100",
    "director": "Panos Cosmatos",
    "freakout": true,
    "genres": ["Action", "Horror", "Fantasy"],
    "trailerURL": "https://www.youtube.com/embed/CGmnfy6VoJI",
    "short_summary": "The enchanted lives of a couple in a secluded forest are brutally shattered by a nightmarish hippie cult and their demon-biker henchmen, propelling a man into a spiraling, surreal rampage of vengeance.",
    "summary": "Pacific Northwest. 1983 AD. Outsiders Red Miller (Nicolas Cage) and Mandy Bloom (Andrea Riseborough) lead a loving and peaceful existence. When their pine-scented haven is savagely destroyed by a cult led by the sadistic Jeremiah Sand (Linus Roache), Red is catapulted into a phantasmagoric journey filled with bloody vengeance and laced with fire."
  },
  {
    "name": "Spider-Man: Into the Spider-Verse",
    "id": 81,
    "image": "../../img/spider-man-into-the-spider-verse.jpg",
    "decade": "10s",
    "year": 2018,
    "rt_score": 97,
    "rt_range": "90-100",
    "director": "Bob Persichetti, Peter Ramsey, Rodney Rothman",
    "freakout": false,
    "genres": ["Action", "Sci-Fi"],
    "trailerURL": "https://www.youtube.com/embed/g4Hbz2jLxvQ",
    "short_summary": "Teen Miles Morales becomes Spider-Man of his reality, crossing his path with five counterparts from other dimensions to stop a threat for all realities.",
    "summary": "Phil Lord and Christopher Miller, the creative minds behind The Lego Movie and 21 Jump Street, bring their unique talents to a fresh vision of a different Spider-Man Universe, with a groundbreaking visual style that's the first of its kind. Spider-Man: Into the Spider-Verse introduces Brooklyn teen Miles Morales, and the limitless possibilities of the Spider-Verse, where more than one can wear the mask."
  },
  {
    "name": "Between Worlds",
    "id": 82,
    "image": "../../img/between-worlds.jpg",
    "decade": "10s",
    "year": 2018,
    "rt_score": 29,
    "rt_range": "Rotten",
    "director": "Mario Pulera",
    "freakout": false,
    "genres": ["Suspense", "Drama", "Fantasy"],
    "trailerURL": "https://www.youtube.com/embed/ifbLeBskpew",
    "short_summary": "Joe meets a mother who can contact spirits when suffocating. Her daughter is dying when Joe helps the mother spiritually contact the daughter and save her. Unfortunately, the spirit in the daughter's body is now that of Joe's dead wife.",
    "summary": "Between Worlds follows Joe (Cage), a down-on-his-luck truck driver haunted by the memory of his deceased wife and child. He meets Julie (Potente) a spiritually gifted woman who enlists Joe in a desperate effort to find the lost soul of her comatose daughter, Billie (Mitchell). But the spirit of Joe's dead wife Mary proves stronger, possessing the young woman's body and determined to settle her unfinished business with the living."
  },
  {
    "name": "A Score to Settle",
    "id": 83,
    "image": "../../img/a-score-to-settle.jpg",
    "decade": "10s",
    "year": 2019,
    "rt_score": 15,
    "rt_range": "Rotten",
    "director": "Shawn Ku",
    "freakout": false,
    "genres": ["Suspense", "Action"],
    "trailerURL": "https://www.youtube.com/embed/3PDU2f5ViWo",
    "short_summary": "An ex-enforcer for a local crime syndicate has vowed to enact retribution on his mob bosses after 19 years of wrongful imprisonment. The only thing diverting his violent plans is a new found relationship to his beloved son.",
    "summary": "Diagnosed with a fatal condition, Frankie Carver (Nicolas Cage) is released from prison after serving 19 years of hard time. With only a short time left to live, Frankie must desperately try to make amends with the son he left behind while he plots a bloody course of revenge - tracking down his old gang to make them pay one by one."
  },
  {
    "name": "Running with the Devil",
    "id": 84,
    "image": "../../img/running-with-the-devil.jpg",
    "decade": "10s",
    "year": 2019,
    "rt_score": 22,
    "rt_range": "Rotten",
    "director": "Jason Cabell",
    "freakout": false,
    "genres": ["Drama"],
    "trailerURL": "https://www.youtube.com/embed/C4v4rgeW8ME",
    "short_summary": "The CEO of an international conglomerate sends two of his most regarded executives to investigate why shipments of cocaine are being hijacked and over cut somewhere on the supply chain.",
    "summary": "When a cocaine shipment is compromised to the dismay of a drug cartel's CEO, known simply as The Boss, he orders his most trusted henchman, The Cook, and his partner, another master drug trafficker known as The Man, on a dangerous journey to audit the company's supply chain. As the drugs make their perilous trek across international borders, past gangsters, refiners, and couriers, they are also being tracked by Federal Agents. When The Cook realizes where the network is breaking down, it may be too late to keep the cartel satisfied."
  },
  {
    "name": "Color Out of Space",
    "id": 85,
    "image": "../../img/color-out-of-space.jpg",
    "decade": "10s",
    "year": 2019,
    "rt_score": "85 (before release)",
    "rt_range": "80-89",
    "director": "Richard Stanley",
    "freakout": false,
    "genres": ["Horror", "Sci-Fi"],
    "trailerURL": "https://www.youtube.com/embed/RfYAXMwCpk0",
    "short_summary": "A town is struck by a meteorite and the fallout is catastrophic. Based on the story by H.P. Lovecraft.",
    "summary": "After a meteorite lands in the front yard of their farm, Nathan Gardner (Nicolas Cage) and his family find themselves battling a mutant extraterrestrial organism as it infects their minds and bodies, transforming their quiet rural life into a technicolor nightmare."
  }
]
